export const faqDataUkr = [
  {
    id: 1,
    question: 'Для чого ця платформа?',
    answer:
      "Відповідь: Наша платформа призначена для комплексної оцінки технічних співбесід. Тут ви зможете взаємодіяти з більш досвідченими користувачами у вашій сфері, які нададуть об'єктивну оцінку та конструктивний зворотний зв'язок. Ви отримаєте цінний практичний досвід і детальну статистику, що допоможе вам краще зрозуміти ваші сильні та слабкі сторони, а також підготуватися до реальних співбесід.",
  },
  {
    id: 2,
    question: 'Що якщо я початківець і не маю досвіду в співбесідах?',
    answer:
      "Відповідь: Не хвилюйтесь! Наша платформа підходить для всіх рівнів, і особливо корисна для початківців. Ви можете практикуватися з іншими початківцями або професіоналами, які нададуть вам цінний зворотний зв'язок і підтримку. Ми тут, щоб допомогти вам здобути впевненість і навички, необхідні для успішного розвитку.",
  },
  {
    id: 3,
    question: 'Чи отримаю я зворотний зв’язок після співбесіди?',
    answer:
      'Відповідь: Після кожної співбесіди обидва учасники заповнюють форму зворотного зв’язку. Результати будуть доступні на вашій особистій панелі, що дозволить вам легко відслідковувати свої досягнення, отримувати інсайти та продовжувати вдосконалюватися після кожної сесії.',
  },
  {
    id: 4,
    question: 'Чи можу я відслідковувати свій прогрес?',
    answer:
      'Відповідь: Відслідковування ваших досягнень і прогресу є важливою частиною нашої платформи. Ми маємо спеціальну сторінку, де зібрані всі статистичні дані про ваш прогрес. Ми надаємо корисні інсайти, які допоможуть вам зрозуміти свої досягнення і визначити наступні кроки в розвитку.',
  },
  {
    id: 5,
    question: 'Як швидко я можу запланувати свою першу співбесіду?',
    answer:
      'Відповідь: Ви можете запланувати свою першу співбесіду після завершення реєстрації. Платформа пропонує гнучкі варіанти планування, щоб врахувати вашу доступність.',
  },
  {
    id: 6,
    question: 'Скільки триває співбесіда?',
    answer:
      'Відповідь: Практика співбесіди зазвичай триває до 40 хвилин, в залежності від типу та формату співбесіди, узгодженого між вами та роллю.',
  },
  {
    id: 7,
    question: 'Це допоможе впоратися з хвилюванням під час співбесіди?',
    answer:
      "Відповідь: Платформа надає підтримуюче середовище, де ви можете практикуватися кілька разів, отримувати конструктивний зворотний зв'язок і поступово ставати більш впевненим в процесі співбесіди, знижуючи рівень тривожності з часом.",
  },
  {
    id: 8,
    question: 'Що потрібно для проходження співбесіди?',
    answer:
      'Відповідь: Все, що вам потрібно, це базове навчання з обраних навичок. Співбесіда проходить онлайн через наш сервіс, тому важливо знайти тихе місце, перевірити стабільність інтернету і бути готовим до нового досвіду.',
  },
  {
    id: 9,
    question: 'Чи є контент платним чи безкоштовним?',
    answer:
      "Відповідь: Наша платформа абсолютно безкоштовна для використання. Ви можете вдосконалювати свої навички співбесід без будь-яких витрат. Ми віримо в надання можливості для розвитку кожному, незалежно від рівня досвіду. Приєднуйтесь до нас сьогодні і отримуйте реальний зворотний зв'язок від професіоналів, щоб допомогти вам досягти успіху в кар'єрі!",
  },
  {
    id: 10,
    question: 'Які спеціальності доступні для практики на платформі?',
    answer:
      'Відповідь: Наразі ми пропонуємо широкий спектр ІТ-спеціальностей та навичок на нашій платформі. Ми постійно розширюємо цей список і впроваджуємо нові можливості для практики. В майбутньому ми плануємо додати інші галузі, що дозволить вам розвивати навички в різних сферах.',
  },
];
