export const blogArr = [
  {
    title: 'Симуляція реальних співбесід з AI',
    data: '03/06/2025',
    version: 'ver 1.2',
    text: 'Додали функцію, де штучний інтелект буде виконувати роль інтерв\'юера, ставлячи питання та аналізуючи відповіді в режимі реального часу.',
  },
  {
    title: 'Менторська панель',
    data: '01/02/2025',
    version: 'ver 1.1',
    text: 'Оновили функціонал особистого менторства, додавши панель управління, де ментори можуть бачити результати співбесід своїх підопічних, аналізувати їхній прогрес і надавати зворотний зв\'язок.',
  },
];