export const uk = {
  translation: {
    general: {
      registration: 'Реєстрація',
    },
    hero: {
      title: 'Мультифункціональна платформа від розробників для розробників',
      text: "Інтерв'ю. Рейтинги. Резюме",
    },
    about: {
      title: 'Як це працює',
      text1: 'Замовляйте співбесіди, коли захочете.',
      text2: 'Проведіть співбесіду зі своїм інтерв’юером чи респондентом.',
      text3:
        'Отримайте докладний, дієвий відгук про те, над чим саме вам потрібно працювати, щоб отримати роботу, на яку ви заслуговуєте.',
    },
    footer: {
      copyright: '© 2023 Devrate, Inc. Усі права захищено.',
      trademarks: 'Усі торгові марки, логотипи та назви брендів є <br/> власністю відповідних власників.',
    },
    modal: {
      title_reset: 'Скинути пароль',
      text_privacy: 'Продовжуючи, Ви погоджуєтеся з нашою політикою конфіденційності і умовами користування.',
      return_on: 'Повернутися на ',
      news_letter: 'Надсилати мені новини, опитування та спеціальні пропозиції від DEVRATE',
      agreement: 'Я прочитав (ла) та погоджуюсь з умовами користування',
      send_letter_title:
        'Будь ласка, заповніть адресу електронної пошти, яку Ви використовували при реєстрації. Вам буде надіслано електронний лист з інструкціями щодо скидання пароля.',
      login: 'Увійдіть у свій обліковий запис DEVRATE',
    },
    inputs_errors: {
      required: "Це обов'язкове поле",
      email_invalid: 'Недійсна електронна пошта',
      password_must_match: 'Паролі мають збігатися',
      password_short: 'Пароль занадто короткий',
      password_long: 'Пароль занадто довгий',
      first_name_long: 'Імʼя занадто довге',
      first_name_short: 'Імʼя занадто коротке',
      last_name_long: 'Прізвище занадто довге',
      last_name_short: 'Прізвище занадто коротке',
    },
    inputs: {
      email: 'Електронна пошта',
      country: 'Країна',
      first_name: 'Імʼя',
      last_name: 'Прізвище',
      password: 'Пароль',
      password_repeat: 'Повторити пароль',
      password_tooltip: 'Паролі повинні містити 7 + символів, принаймні 1 цифру, принаймні 1 літеру та без пробілів.',
    },
    countries: {
      ukraine: 'Україна',
      poland: 'Польща',
      usa: 'США',
    },
    buttons: {
      btn_login: 'Увійти',
      btn_send_letter: 'Відправити лист',
      btn_change_password: 'Змінити пароль',
      btn_register: 'Зареєструватись',
    },
    links: {
      home_page: 'Головну сторінку',
      about_platform: 'Про платформу',
      community: "Ком'юніті",
      contacts: 'Контакти',
      forgot_your_password: 'Забули Свій Пароль',
      terms_and_conditions: 'Правила та умови',
      privacy_policy: 'Політика конфіденційності',
    },
  },
};
