export const uk = {
  translation: {
    header: {
      search: 'Пошук',
      notFound: 'За цим запитом немає збігів',
    },
    home: {
      header: {
        howItWorks: 'Як це працює',
        aboutUs: 'Про нас',
        faq: 'FAQ',
        contacts: 'Контакти',
        login: 'Увійти',
        profile: 'Профіль',
      },
      hero: {
        title: 'Мультифункціональна платформа від розробників для розробників',
        text: "Інтерв'ю. Рейтинги. Резюме",
        button_text: 'Реєстрація',
        mainText1: 'Підготуйтесь до',
        mainText2: 'Технічних',
        mainText3: 'Співбесід',
        mainText4: ' за підтримки',
        mainText5: 'від',
        mainText6: 'Експертів і Однодумців!',
        secondaryText:
          'Опануйте навички проходження співбесід за допомогою реальної практики разом з експертами та однодумцями. Отримуйте персоналізований зворотний зв’язок, об’єктивні оцінки та глибокі аналітичні інсайти, щоб упевнено підготуватися до успіху на будь-якій співбесіді!',
        secondaryTextMobile: "Щоб зареєструватися, відкрийте сайт на комп'ютері",
        registration: 'Реєстрація',
      },
      howItWorks: {
        titleText1: 'Як це',
        titleText2: 'працює?',
        card1Title: 'Зареєструйте свій профіль',
        card1Text:
          'Створіть профіль і заповніть інформацію про свій досвід роботи, жорсткі навички, досягнення та освіту.',

        card2Title: 'Приєднуйтесь до співбесіди',
        card2Text:
          'Виберіть, чи хочете ви практикуватися як респондент або як інтерв’юер. Оберіть зручний час і формат.',

        card3Title: 'Отримайте зворотний зв’язок',
        card3Text:
          'Отримайте детальний зворотний зв’язок, який допоможе вам покращити ваші м’які та жорсткі навички у своїй спеціалізації.',
      },
      aboutUs: {
        article1Title: 'Реальний досвід',
        article1Text:
          'Ми створюємо реалістичне середовище для технічних співбесід, допомагаючи вам підготуватися до складних завдань і запитань.',

        article2Title: 'Спільнота однодумців',
        article2Text: 'Спілкуйтеся з іншими розробниками, які готові ділитися знаннями та допомагати.',

        article3Title: 'Дружнє середовище для початківців',
        article3Text: 'Практикуйтеся у просторі, де помилки — це частина навчального процесу, а не невдачі.',

        article4Title: 'Зворотний зв’язок',
        article4Text:
          'Ви отримаєте детальний аналіз своїх відповідей, що допоможе вам ефективніше підготуватися до реальних технічних співбесід.',
      },
      about: {
        title: 'Як це працює',
        text1: 'Замовляйте співбесіди, коли захочете.',
        text2: 'Проведіть співбесіду зі своїм інтерв’юером чи респондентом.',
        text3:
          'Отримайте докладний, дієвий відгук про те, над чим саме вам потрібно працювати, щоб отримати роботу, на яку ви заслуговуєте.',
      },
      footer: {
        copyright: '© 2023 SKILLZZY, Inc. Усі права захищено.',
        trademarks: 'Усі торгові марки, логотипи та назви брендів є <br/> власністю відповідних власників.',
        footerText:
          'Платформа для підготовки до технічних співбесід: підвищуйте свої навички разом із початківцями та досвідченими професіоналами. Наша платформа створена, щоб зробити процес підготовки до співбесід простішим і менш стресовим для всіх.',
        developedText: 'Розроблено',
        termsAndConditions: 'Умови та положення',
        privacyPolicy: 'Політика конфіденційності',
        allRightsReserved: 'Всі права захищені.',
        allTrademarks: 'Усі товарні знаки, логотипи та торгові найменування є власністю їхніх відповідних власників.',

        placeholderName: 'Ім’я Прізвище',
        placeholderEmail: 'Введіть вашу електронну пошту',
        placeholderRequest: 'Введіть ваш запит...',
        buttonText: 'НАДІСЛАТИ',
      },
      links: {
        home_page: 'Головну сторінку',
        about_platform: 'Про платформу',
        community: "Ком'юніті",
        contacts: 'Контакти',
        login: 'Увійти',
        terms_and_conditions: 'Правила та умови',
        privacy_policy: 'Політика конфіденційності',
      },
    },
    modal: {
      interview: {
        title: 'Залишити відгук',
        label: 'Відгук',
        placeholder: 'Будь ласка, залиште свій відгук',
        btnSend: 'Надіслати',
        btnNext: 'Далі',
        btnBack: 'Назад',
        INTERVIEWER: 'Інтерв’юер',
        CANDIDATE: 'Кандидат',
        required: "Це поле обов'язкове до заповнення",
        long: 'Це поле занадто довге',
        short: 'Це поле занадто коротке',
        submit: {
          success: 'Ваш відгук успішно надіслано',
          error: 'Помилка відправки відгуку',
        },
      },
      achievement: {
        title: 'Досягнення',
        summary: 'Назва досягнення',
        summary_long: 'Назва досягнення задовга. Внесіть, будь-ласка, зміни',
        summary_short: 'Назва досягнення закоротка. Внесіть, будь-ласка, зміни',
        summary_placeholder: 'Ruby Association Certified Programmer Examination (RY0-100 та RY0-200)',
        link: 'Посилання',
        link_long: 'Довге посилання. Внесіть, будь-ласка, зміни',
        link_short: 'Посилання занадто коротке. Внесіть, будь-ласка, зміни',
        link_placeholder: 'https://skillzzy.com/certificate_id=12345678987654321',
        description: 'Опис досягнення',
        description_long: 'Довгий опис досягнення. Внесіть, будь-ласка, зміни',
        description_short: 'Опис досягнення занадто короткий. Внесіть, будь-ласка, зміни',
        description_placeholder:
          'Сертифікація визнає особу як експерта у галузі мережевих технологій. Підтверджує знання та навички у розгортанні, управлінні та усуненні неполадок у мережевих середовищах.',
        required: "Це обов'язкове поле",
      },
      education: {
        title: 'Освіта',
        type: 'Спеціальність',
        name: 'Навчальний заклад',
        description: 'Опис',
        startYear: 'Рік початку',
        endYear: 'Рік закінчення',
        now: 'Зараз',
      },
      checkEmailResetPassword: {
        title: 'Скидання пароля',
        subtitle1: 'Будь ласка, заповніть адресу електронної пошти, яку Ви використовували при реєстрації.',
        subtitle2: 'Вам буде надіслано електронний лист з інструкціями щодо скидання пароля.',
        email: 'Електронна пошта',
        btn_send_letter: 'Відправити Код',
        subtitle3: 'Не отримали листа? Перевірте папку «Спам».',
        // privacy_policy: 'Політика конфіденційності',
        // terms_and_conditions: 'Правила та умови',
        resend_link: 'Відправити повторно',
        middle_text: 'запит або ',
        change_email: 'змінити email',
        // home_page: 'Головну сторінку',
        email_invalid: 'Недійсна електронна пошта',
        required: "Це обов'язкове поле",
      },
      login: {
        title: 'Увійдіть в аккаунт',
        subtitle: 'Увійдіть в обліковий запис SKILLZZY',
        email: 'Електронна пошта',
        password: 'Пароль',
        password_tooltip:
          'Паролі повинні містити 8 + символів, принаймні один спецільний символ (@,$,!,%,?,&), цифру, велику та малу літеру та без пробілів.',
        forgot_your_password: 'Забули Свій Пароль',
        btn_login: 'Увійти',
        text_privacy: 'Продовжуючи, Ви погоджуєтеся з нашою',
        text_privacy_policy: 'Політикою конфіденційності',
        text_privacy_terms: 'Умовами користування',
        return_on: 'Повернутися на ',
        home_page: 'Головну сторінку',
        email_invalid: 'Недійсна електронна пошта',
        required: "Це обов'язкове поле",
        password_short: 'Пароль занадто короткий',
        password_long: 'Пароль занадто довгий',
        password_invalid: 'Неприпустимий пароль',
      },
      registration: {
        title: 'Реєстрація',
        email: 'Електронна пошта',
        country: 'Країна',
        first_name: 'Імʼя',
        last_name: 'Прізвище',
        password: 'Пароль',
        password_repeat: 'Повторити пароль',
        password_tooltip: 'Паролі повинні містити 8 + символів, принаймні 1 цифру, принаймні 1 літеру та без пробілів.',
        password_invalid: 'Неприпустимий пароль',
        news_letter: 'Надсилати мені новини, опитування та спеціальні пропозиції від SKILLZZY',
        agreement: 'Я прочитав (ла) та погоджуюсь з умовами користування',
        agreement_error: 'Для використання нашого сервісу вам необхідно погодитися з умовами користування',
        btn_register: 'Зареєструватись',
        privacy_policy: 'Політика конфіденційності',
        terms_and_conditions: 'Правила та умови',
        email_invalid: 'Недійсна електронна пошта',
        required: "Це обов'язкове поле",
        first_name_long: 'Імʼя занадто довге',
        first_name_short: 'Імʼя занадто коротке',
        first_name_invalid_characters: 'Дозволені лише літери',
        last_name_long: 'Прізвище занадто довге',
        last_name_short: 'Прізвище занадто коротке',
        last_name_invalid_characters: 'Дозволені лише літери',
        password_short: 'Пароль занадто короткий',
        password_long: 'Пароль занадто довгий',
        password_must_match: 'Паролі мають збігатися',
      },
      confirmation: {
        title: 'Підтвердіть Свою Електронну Адресу',
        code_error_text: 'На жаль, термін дії коду минув або він ненадійний',
        main_text1: 'Щоб завершити налаштування облікового запису, необхідно підтвердити свою електронну пошту',
        main_text2: 'Перевірте свою електронну пошту та введіть код нижче.',
        btn_confirm: 'Зареєструватись',
        spam_check_text: 'Неотримали листа? Перевірте папку спам.',
        repeat_request_link: 'Повторно надішліть',
        repeat_request_text1: 'запит',
        repeat_request_text2: 'або',
        change_email_link: 'змініть електронну адресу',
        text1: 'Текст 1 має містити рівно один символ',
        required_text1: "Текст 1 обов'язковий",
        text2: 'Текст 2 має містити рівно один символ',
        required_text2: "Текст 2 обов'язковий",
        text3: 'Текст 3 має містити рівно один символ',
        required_text3: 'Текст 3 має містити рівно один символ',
        text4: 'Текст 4 має містити рівно один символ',
        required_text4: "Текст 4 обов'язковий",
        text5: 'Tекст 5 має містити рівно один символ',
        required_text5: "Текст 5 обов'язковий",
        text6: 'Текст 6 має містити рівно один символ',
        required_text6: "Текст 6 обов'язковий",
        // return_on: 'Back to ',
        // home_page: 'Home',
      },
      notificationModal: {
        title: 'Скинути пароль',
        message: 'Ваш пароль було успішно змінено',
        btn_enter: 'УВІЙТИ',
      },
      resetPassword: {
        title: 'Скинути пароль',
        password: 'Пароль',
        password_tooltip: 'Паролі повинні містити 8 + символів, принаймні 1 цифру, принаймні 1 літеру та без пробілів.',
        password_repeat: 'Повторити пароль',
        btn_change_password: 'Змінити пароль',
        text_privacy: 'Продовжуючи, Ви погоджуєтеся з нашою політикою конфіденційності і умовами користування.',
        return_on: 'Повернутися на ',
        home_page: 'Головну сторінку',
        required: "Це обов'язкове поле",
        password_short: 'Пароль занадто короткий',
        password_long: 'Пароль занадто довгий',
        password_must_match: 'Паролі мають збігатися',
        password_invalid: 'Неприпустимий пароль',
        not_valid: 'Пароль не валiдний',
        code_required: "Код обов'язковий",
        code_symbol_min: 'Кожна цифра коду повинна мати довжину 1 символ',
        code_length_max: 'Code must be exactly 6 digits long',
        error: 'Невірний код. Спробуйте ще раз.',
        success: 'Пароль успішно змінено!',
      },
      editPage: {
        personalInformation: {
          title: 'Про мене',
        },
        workExperience: {
          title: 'Опис',
        },
      },
      feedbackProjectModal: {
        title: 'Залиште відгук',
        type_of_feedback: {
          PROPOSITION: 'Пропозиція',
          ISSUE: 'Помилка',
          FEEDBACK: 'Відгук',
        },
        required: 'Це обов’язкове поле',
        long: 'Це поле задовге',
        short: 'Це поле закоротке',
        feedback: "Зворотній зв'язок",
        button: 'Надіслати',
        formSelectLabel: "Тип зворотного зв'язку",
        textAreaLabel: 'Повідомлення',
        textPlaceholder: 'Будь ласка, напишіть свій відгук тут...',
        error_429: 'Ви вже відправляли фідбек в цьому місяці',
        error_request: 'Помилка запиту',
        success: 'Відгук надіслано успішно',
      },
    },
    profile: {
      skills: {
        skillsTitle: 'Навички',
        hardSkills: 'Hard skills',
        softSkills: 'Soft skills',
        doneInterviews: 'інтерв’ю пройдено',
        completedInterviews: 'інтерв’ю проведено',
      },
      baseUserInfo: {
        loading: 'Ваш профіль заповнено на',
        complete: 'Вітаємо! Ваш профіль повністю заповнений',
        messageBtn: 'Написати повідомлення',
        interviewBtn: 'Забронювати співбесіду',
      },
      experience: {
        workExperience: {
          tabName: 'Досвід роботи',
          emptyTabName: {
            tabName: 'Досвід роботи',
            title: 'Додайте інформацію про свій досвід роботи',
            subTitle: 'Це допоможе іншим користувачам дізнатися про вас більше!',
            button: 'Додати досвід роботи',
            userProfile: {
              title: 'Користувач ще не додав інформацію про досвід роботи',
            },
          },
        },
        achievement: {
          tabName: 'Досягнення',
          emptyTabName: {
            tabName: 'Досягнення',
            title: 'Додайте інформацію про свої досягнення',
            subTitle: 'Ви можете додати свої сертифікати чи інші досягнення та прикріпити до них посилання!',
            button: 'Додайте досягнення',
            userProfile: {
              title: 'Користувач ще не додав інформацію про досягнення',
            },
          },
        },
        skills: {
          tabName: 'Навички',
          emptyTabName: {
            tabName: 'Навички',
            title: 'Додайте інформацію про свої навички',
            subTitle: 'Додайте спеціалізації та навички з них, якими ви зараз володієте!',
            button: 'Додайте спеціалізації',
            userProfile: {
              title: 'Користувач ще не додав інформацію про навички',
            },
          },
          allSkills: 'Всі навички',
          search: 'Пошук',
          star: 'Основна спеціалізація',
        },
        education: {
          tabName: 'Освіта',
          emptyTabName: {
            tabName: 'Освіта',
            title: 'Додайте інформацію про свою освіту',
            subTitle: 'Розкажіть іншим користувачам про місця, які ви вивчали, та отриманий досвід!',
            button: 'Додайте освіту',
            userProfile: {
              title: 'Користувач ще не додав інформацію про освіту',
            },
          },
          endYearNow: 'Теперішній час',
        },
        duties: 'Обовʼязки',
        endYear: 'Теп. час',
      },
      right: {
        empty: {
          emptyContacts: 'Ви ще не додали жодного контакту',
          emptyLanguages: 'Ви ще не додали жодної мови.',
          emptyAboutMe:
            'Ви ще не додали інформацію про себе.\n' +
            'Для того, щоб редагувати інформацію про себе, зайдіть в налаштування профілю.',
        },
        contact: 'Контактна інформація',
        languages: 'Мови',
        aboutMe: 'Про мене',
      },
      userMenu: {
        profile: 'Профіль',
        schedule: 'Розклад',
        specializations: 'Спеціалізації',
        interviews: 'Співбесіди',
        settings: 'Налаштування',
        bookmark: 'Збережене',
        faq: 'FAQ',
        logout: 'Вийти',
        leaveAFeedback: 'Залиште відгук',
      },
      experienceSection: {
        readAll: 'Читати далі...',
        collapse: 'Згорнути',
      },
      modal: {
        btn: 'Зберегти',
        finish: 'Готово',
        userInfo: {
          personal: {
            title: 'Персональна інформація',
            firstName: "Ім'я",
            first_name_long: 'Імʼя занадто довге',
            first_name_short: 'Імʼя занадто коротке',
            first_name_invalid_characters: '',
            lastName: 'Прізвище',
            last_name_long: 'Прізвище занадто довге',
            last_name_short: 'Прізвище занадто коротке',
            last_name_invalid_characters: '',
            city: 'Місто',
            city_short: 'Назва міста дуже коротка',
            city_long: 'Назва міста дуже довга',
            city_invalid: 'Назва міста недійсна',
            city_invalid_characters: 'Обрізати останні символи міста',
            country: 'Країна',
            status: 'Статус',
            status_too_long: 'Поле статус дуже довге',
            about_me: 'Про мене',
            about_me_too_long: 'Поле "Про мене" дуже довге',
            required: "Це обов'язкове поле",
            endYear_min: 'Дата завершення має бути пізнішою за дату початку',
            endYear_max: 'Дата закінчення має бути не пізніше поточного року',
            startYear_min: 'Дата має бути пізніше 01/01/1950',
            startYear_max: 'Дата має бути не пізніше поточного року',
          },
          contact: {
            title: 'Контактна інформація',
            telegram: {
              label: 'Telegram',
              placeholder: '@username',
            },
            linkedIn: {
              label: 'LinkedIn',
              placeholder: 'https://www.linkedin.com/in/',
            },
            gitHub: {
              label: 'GitHub',
              placeholder: 'https://github.com/',
            },
            behance: {
              label: 'Behance',
              placeholder: 'https://www.behance.net/',
            },
            mail: {
              label: 'Електронна пошта',
              placeholder: 'example@gmail.com',
            },
            phone: 'Мобільний телефон',
            validation: {
              url: 'Введіть коректний URL',
              phone: 'Введіть коректний телефонний номер',
            },
          },
          photo: {
            title: 'Фотографія',
            dropPhoto: {
              first: 'Опустіть фото сюди ',
              second: 'або',
              third: ' завантажити зі свого пристрою',
            },
            incorrectAvatar: 'Некоректний формат фото',
            failedLoad: 'Не вдалося завантажити фото',
            imageFileSize: 'Ваше зображення має розмір {{size}}МБ і не повинно перевищувати 5 МБ.',
            imageSize: 'Розмір зображення {{width}}x{{height}} пікселів має бути не менше 98x98 пікселів',
          },
          languages: {
            title: 'Мови',
            language: 'Мова',
            level: 'Рівень знання',
            selectLanguage: 'Виберіть мову.',
            selectLevel: 'Виберіть рівень.',
            languageAdded: 'Цю мову вже додано.',
          },
        },
        workExperience: {
          position: 'Посада',
          title: 'Досвід роботи',
          position_long: 'Посада занадто довге',
          position_short: 'Посада занадто коротка',
          position_placeholder: 'Інженер-програміст',
          companyName: 'Company',
          companyName_long: 'Компанія занадто довге',
          companyName_short: 'Компанія занадто коротка',
          companyName_placeholder: 'Простір Аверга',
          description: 'Опис',
          description_long: 'Опис занадто довгий',
          description_short: 'Опис занадто короткий',
          description_placeholder:
            'Prosper є лідером у сфері фінтеху, пропонуючи платформу пірингового кредитування, яка поєднує передові технології з фінансовими послугами. Вони використовують алгоритми на основі даних для ефективної та справедливої обробки кредитів, що робить їх актуальними для розробників програмного забезпечення, зацікавлених у перетині технологій та фінансів.',
          responsibilities: 'Обов`язок',
          responsibilities_long: 'Обов`язок занадто довгий',
          responsibilities_short: 'Обов`язок занадто короткий',
          responsibilities_placeholder: 'Бекенд-розробник',
          startDate: 'Дата початку',
          endDate: 'Дата закінчення',
          currentDate: 'На даний момент працюю на цій посаді',
          required: "Це обов'язкове поле",
          startDateMinMessage: 'Стартова дата має бути пізніше 01/01/1950',
          startDateMaxMessage: 'Кінцева дата має бути не пізніше за поточку',
          endDateMessage: 'Кінцева дата має буди пізнішою за стартову дату',
          endYear_min: 'Дата завершення повинна бути пізніше дати початку',
          endYear_max: 'Кінцева дата не може бути пізніше цього року',
        },
        education: {
          title: 'Освіта',
          type: 'Спеціальність',
          name: 'Навчальний заклад',
          startYear: 'Рік початку',
          endYear: 'Рік закінчення',
          currentDate: 'На даний момент вчуся у цьому закладі',
          speciality_long: 'Спеціальність занадто довга',
          speciality_short: 'Спеціальність занадто коротка',
          speciality_placeholder: 'Облік та аудит',
          edInstitution: 'Навчальний заклад',
          edInstitution_long: 'Назва навчального закладу занадто довга',
          edInstitution_short: 'Назва инавчального закладу занадто коротка',
          edInstitution_placeholder: 'Окфорд',
          description: 'Опис',
          description_long: 'Опис занадто довгий',
          description_short: 'Опис занадто короткий',
          description_placeholder:
            'Мої навички у програмуванні на PHP, використанні ООП та підходу MVC підтримуються значним досвідом роботи з базами даних, такими як MySQL та PostgreSQL. Я ефективно використовую фреймворк Laravel 5.3 для розробки масштабованих веб-додатків та володію базовими знаннями Symfony 3, зокрема Sonata.',
          required: 'This field is required',
          startDateMinMessage: 'Стартова дата має бути пізніше 01/01/1950',
          startDateMaxMessage: 'Кінцева дата має бути не пізніше за поточку',
          endDateMessage: 'Кінцева дата має буди пізнішою за стартову дату',
        },
      },
    },
    specialization: {
      specialization_title: 'Спеціалізації',
      specialization_btn_make_main: 'Зробити основною',
      specialization_hardSkills: 'HardSkills',
      specialization_softSkills: 'SoftSkills',
      error: 'Щось пішло не так...',
      errorDeleteSpec: 'Ви не можете видалити спеціалізацію',
      conflictDeleteSpec:
        'Ви не можете видалити спеціалізацію через наявну співбесіду або запити на співбесіду по цій спеціалізації.',
      level: {
        title: 'Рівень',
        description: 'Покращуйте свої навички, щоб перейти на наступний рівень поточної спеціалізації.',
      },
      interviewChartMonths: {
        '01': 'Січ',
        '02': 'Лют',
        '03': 'Бер',
        '04': 'Кві',
        '05': 'Тра',
        '06': 'Чер',
        '07': 'Лип',
        '08': 'Сер',
        '09': 'Вер',
        10: 'Жов',
        11: 'Лис',
        12: 'Гру',
      },
      statistics: {
        title: 'Статистика',
        level_chart_title: 'Рівень',
        hard_skills_chart_title: 'Hard Skills за продуктивністю',
        hard_skills_chart_text: 'Цей графік відображає оцінки ваших навичок від 0 до 10.',
        interview_chart_title: 'Інтерв’ю',
        interview_chart_days: '10 днів',
        interview_chart_months: 'Місяці',
        skills_assessment_chart_title: 'Середня оцінка навичок',
        levelUp: 'За результатами рекомендуємо переходити на наступний рівень!',
      },
      interviewsChart: {
        conducted: 'Проведено',
        passed: 'Пройдено',
      },
      hardSkills: {
        title: 'Хард скіли',
        averageMark: 'Середня оцінка:',
        emptySkills:
          'Зараз у вашому профілі немає жодних навичок. Додайте їх, щоб покращити себе та відстежувати свій прогрес',
      },
      softSkills: {
        title: 'Soft skills',
        averageMark: 'Середня оцінка:',
        emptySkills: 'Пройдіть співбесіду, щоб користувачі оцінили ваші Soft Skills',
      },
      modal: {
        specialization: {
          create: 'Створити спеціалізацію',
          modal_title: 'Спеціалізація',
          name: 'Назва спеціалізації',
          name_placeholder: 'Front-End Розробник',
          mastery: 'Основний рівень',
          mastery_helper_text:
            'Рівень для формування Вашої статистики, яка буде відібражатися в на сторінці Вашого профілю',
          required: "Це обов'язкове поле",
          max_length: 'Назва вміння може мати довжину не більше 100 символів',
          errorDuplicate: 'Така спеціалізація вже існує',
        },
        skills: {
          title: 'Навички',
          placeholder: 'Codelgniter, Yii, Zend Framework',
          no_skills: 'Немає доступних навичок',
          errorDuplicate: 'Такий навик вже існує',
          errorRequired: "Це обов'язкове поле",
          errorLength: 'Назва навички занадто довга',
          errorQuantity: 'Ви можете додати до 20 навичок',
          errorNotAvailable: 'Немає доступних навичок',
        },
        interview: {
          income: "Пройдено інтерв'ю",
          outcome: "Проведено інтерв'ю",
          planInterview: 'Запланувати інтерв’ю',
          makeIncome: 'Запланувати інтерв’ю',
          makeOutcome: "Стати інтерв'юером",
        },
        scheduleModal: {
          name: "Ім'я",
          specialization: 'Спеціалізація',
          level: 'Рівень',
          role: 'Роль',
          date: 'Дата',
          startTime: 'Час початку',
          endTime: 'Час закінчення',
          socialLinks: 'Додати посилання на соцмережі',
          schedule: 'Запланувати',
          skill_long: 'Назва задовга',
          skill_short: 'Назва закоротка',
        },
        specializationEdit: {
          error_message: 'По-перше, пройдіть усі відкриті співбесіди на поточному рівні!',
        },
        confirmSpecializationDelete: {
          title: 'Видалити спеціалізацію',
          text1: 'Ви впевнені, що хочете видалити спеціалізацію',
          text2: 'Усі дані та статистику для цієї спеціалізації буде втрачено.',
          refuseBtnText: 'Відмінити',
          confirmBtnText: 'Видалити',
        },
      },
      language: {
        level: {
          a1: 'Початковий рівень: A1',
          a2: 'Базовий рівень: A2',
          b1: 'Рубіжний рівень: B1',
          b2: 'Середній рівень: B2',
          c1: 'Високий рівень: C1',
          c2: 'Вільне володіння: C2',
        },
        name: {
          ua: 'Українська',
          en: 'Англійська',
          fr: 'Французька',
          it: 'Італійська',
          de: 'Німецька',
          es: 'Іспанська',
          pl: 'Польська',
          cs: 'Чеська',
        },
      },
    },
    dropDownMenu: {
      delete: 'Видалити',
      edit: 'Редагувати',
      main: 'Зробити головною',
    },
    schedule: {
      deleteEventSuccessMessage: 'Подія видалена',
      deleteEventErrorMessage: 'Подія не була видалена',
      title: 'Розклад',
      host: 'Хост',
      participant: 'Учасник',
      cancelEventBtn: 'Відмінити івент',
      popupUserInfo: 'Інформація про вас',
      popupInterviewerInfo: 'Інформація про співбесідника',
      popupRole: 'Роль:',
      CANDIDATE: 'Кандидат',
      INTERVIEWER: 'Інтерв’юер',
      link: "Доєднатись до інтерв'ю",
    },
    notifications: {
      empty: 'На даний момент у вас ще немає нових сповіщень',
      newNotifications: 'Нове',
      hourAgo: 'годин тому',
      lessThanHourAgo: 'Менше години тому',
      interviewScheduled:
        'Вашу співбесіду на роль {{roleLower}} заплановано на {{date}}. Будьте готові та доступні в зазначений час.',
      greeting:
        'Ласкаво просимо! Ми раді вітати вас у Skillzzy — спільноті, де розробники діляться досвідом, навчаються та знаходять нові можливості',
      interviewFeedback:
        'Вітаємо із завершенням співбесіди! Будь ласка, заповніть коротку форму та оцініть навички співрозмовника. Залишити вiдгук',
      interviewRejected:
        'Співбесіду з {{rejectionName}}, заплановану на {{date}}, скасовано. Ми вже працюємо над пошуком нового співрозмовника та скоро повідомимо Вас',
      interviewRequestExpired:
        'Шановний(а) {{userFirstName}}, Ваш запит на співбесіду сплив. Будь ласка, створіть новий, якщо бажаєте продовжити.',
      feedbackBtn: 'Залишити відгук',
    },
    faqText: {
      title: 'FAQ – Питання, що часто задають',
      question1: {
        question: 'Як подати заявку на співбесіду?',
        answer:
          "Щоб подати заявку на співбесіду, перейдіть на сторінку «Співбесіди». У верхньому правому куті екрана натисніть кнопку «Запланувати співбесіду». У випадаючому списку оберіть вашу роль: «Як Інтерв'юер», якщо ви хочете оцінювати кандидатів, або «Як Кандидат», якщо ви хочете пройти оцінювання. Наступним кроком виберіть вашу спеціалізацію з запропонованого списку, мову, якою ви бажаєте провести інтерв'ю, та кількість інтерв'ю для обраних часових слотів. Далі, у формі оберіть зручні для вас дні та час і натисніть кнопку «Запланувати». Ваша заявка буде створена, і ви отримаєте електронний лист та сповіщення про співбесіду, як тільки буде знайдено співрозмовника.",
      },
      question2: {
        question: 'Який вибрати рівень під час створення спеціалізації (Junior, Middle, Senior)?',
        answer:
          'При виборі відповідного рівня враховуйте свій досвід і навички в обраній спеціалізації. Якщо ви тільки починаєте та маєте обмежений практичний досвід, рекомендується рівень Junior. Для тих, хто вже здобув певний досвідом і можуть працювати самостійно з деякими вказівками, Middle рівень може підійти найкраще. Якщо ви маєте великий досвід, можете керувати проектами та наставляти інших, рівень Senior буде найбільш підходящим. Вибір рівня, який точно відображає ваш поточний досвід, має вирішальне значення для забезпечення справедливого процесу оцінювання та вибору відповідних учасників співбесіди.',
      },
      question3: {
        question: 'Скільки часу потрібно чекати на співбесіду?',
        answer:
          "Від моменту створення заявки на інтерв'ю, ми відразу почнемо шукати співрозмовника, який буде відповідати вибраними вами критеріям (спеціалізації, навичкам, рівню, часу і т.д.). Як тільки така людина буде знайдена, ви отримаєте сповіщення з подальшими діями. Якщо упродовж 30 днів ми не зможемо підібрати для вас відповідного співрозмовника, ви отримаєте повідомлення з рекомендованими діями.",
      },
      question4: {
        question: 'Як скасувати або перенести співбесіду?',
        answer:
          "На даний момент перенесення вже створеної співбесіди не доступне, цей функціонал обов'язково буде імплементований у найближчих версіях. На даний момент, ви можете скасувати співбесіду, що запустить процес пошуку нового співрозмовника. Для того, щоб скасувати співбесіду достатньо перейти на сторінку «Календар», знайти відповідну співбесіду, натиснути на неї і у формі вибрати «Скасувати подію». Також видалення інтервʼю доступне на сторінці Співбесіди > Запити.",
      },
      question5: {
        question: 'Де переглянути результати співбесіди?',
        answer:
          'Щоб переглянути результати співбесіди, перейдіть на сторінку «Співбесіди» — там відображаються загальна оцінка, коментарі та інша важлива інформація.',
      },
      question6: {
        question: "Чи можу я вибрати інтерв'юера або кандидата?",
        answer:
          'Наша система автоматично підбирає найбільш підходящого співрозмовника за допомогою розроблених алгоритмів, що враховують ваші запити. Це дозволяє ефективно оцінити ваші навички та потенціал, забезпечуючи найкращий можливий збіг для ваших потреб.',
      },
      question7: {
        question: 'Як підвищити свій рівень?',
        answer:
          "Для підвищення рівня активно беріть участь у співбесідах як кандидат та інтерв'юер. Позитивні відгуки, постійна демонстрація ваших навичок та розширення експертизи у спеціалізації сприятимуть вашому зростанню. Наша система відстежує ваші результати та прогрес, допомагаючи вам піднятися на новий рівень по мірі демонстрації ваших здібностей.",
      },
      question8: {
        question: "За якими критеріями відбувається підбір інтерв'юера або кандидата?",
        answer:
          "Наша система підбору використовує кілька основних критеріїв для знаходження найбільш відповідних інтерв'юерів та кандидатів. До них належать спеціалізація, рівень навичок, досвід, доступність і часовий пояс. Враховуючи ці фактори, ми забезпечуємо продуктивну та ефективну співбесіду, адаптовану до потреб обох сторін.",
      },
      question9: {
        question: 'Що таке основна спеціалізація і як її обрати?',
        answer:
          'Основна спеціалізація — це ваша ключова сфера, загальні оцінки якої відображатимуться на головному екрані профілю. Вона також буде видима для інших користувачів під час пошуку і позначена як основна, щоб підкреслити ваш головний професійний напрямок.',
      },
      question10: {
        question: 'Скільки триває співбесіда?',
        answer:
          'Практична співбесіда зазвичай триває до 40 хвилин, залежно від типу співбесіди та узгодженого формату між вами та іншим учасником.',
      },
      question11: {
        question: 'Як проводиться оцінювання після співбесіди?',
        answer:
          "Після закінчення співбесіди кожен зі співрозмовників отримає сповіщення про необхідність заповнення результатів. Якщо ви були інтерв'юером, вам потрібно буде оцінити hard та soft навички кандидата й написати загальний коментар. Якщо ж ви були кандидатом, вам потрібно заповнити оцінку soft навичок інтерв'юера та залишити загальний коментар.",
      },
      question12: {
        question: 'Де можна подивитися розклад моїх співбесід?',
        answer:
          'Календар співбесід доступний на сторінці «Розклад». Перейти можна через спливаюче меню праворуч, натиснувши на відповідний розділ.',
      },
      question13: {
        question: 'Що робити, якщо я не отримав запрошення на співбесіду протягом 30 днів?',
        answer:
          "Якщо ви не отримали запрошення на інтерв'ю протягом 30 днів, створіть новий запит, обравши потрібну спеціалізацію, роль (інтерв'юер/кандидат) та зручний для вас день і час.",
      },
      question14: {
        question: 'Як дізнатися, що співбесіду призначено?',
        answer:
          "Коли ми знайдемо співрозмовника, що відповідає вашому запиту, ми надішлемо вам сповіщення та електронний лист на адресу, вказану при реєстрації. Також відповідна співбесіда з'явиться у вашому календарі на екрані «Розклад».",
      },
      question15: {
        question: 'Що потрібно для проходження співбесіди?',
        answer:
          'Все, що вам потрібно — це базова підготовка за обраними вами навичками. Співбесіда відбувається онлайн через наш кастомізований сервіс, тому важливо знайти спокійне місце, переконатися в наявності стабільного інтернету та бути готовим до нового досвіду.',
      },
      question16: {
        question: 'Як повідомити про помилку на сайті?',
        answer:
          'Щоб повідомити про знайдену помилку на сайті, скористайтеся пунктом меню праворуч — «Залишити відгук». У цьому розділі ви також можете поділитися своїми враженнями про сайт і надати пропозиції щодо покращення. Ми щиро вдячні за вашу уважність та підтримку!',
      },
      question17: {
        question: "Що робити, якщо співрозмовник не з'явився на співбесіду?",
        answer:
          "Якщо ваш співрозмовник не з'явився на співбесіду, повідомте про це через форму «Залишити відгук». Система автоматично подасть новий запит, і ми докладемо зусиль, щоб знайти для вас нового співрозмовника найближчим часом.",
      },
      question18: {
        question: 'Як змінити свою контактну інформацію?',
        answer:
          'Щоб змінити свою контактну інформацію, перейдіть у свій профіль, натиснувши на аватар у правому верхньому куті. Далі оберіть опцію «Редагувати профіль» і внесіть необхідні зміни. Не забудьте зберегти нові дані.',
      },
      question19: {
        question: 'Чи можу я запросити на співбесіду когось конкретного?',
        answer:
          'На даний момент система підбору співрозмовників автоматична і не підтримує запрошення конкретної особи. Ми прагнемо забезпечити справедливість і неупередженість підбору, тож покладаємось на автоматичний вибір відповідного співрозмовника для забезпечення ефективної співбесіди.',
      },
    },
    blogText: {
      title: 'Останні оновлення',
      readNext: 'Читати далі...',
      upd1: {
        title: 'Форма зворотнього звязку',
        text: "Додано форму для зворотного зв'язку, де користувачі можуть поділитися своїм досвідом використання платформи, запропонувати покращення або повідомити про виявлені помилки. Форма дозволяє обрати тип відгуку: PROPOSITION (пропозиція), ISSUE (проблема), або FEEDBACK (загальний відгук). Це допоможе нам оперативно реагувати на зауваження, впроваджувати вдосконалення та підтримувати високу якість сервісу, орієнтуючись на ваші потреби та побажання.",
      },
      upd2: {
        title: 'Пошук користувачів',
        text: "Додано функцію пошуку користувачів, яка дозволяє знаходити профілі за ім'ям, прізвищем або комбінацією цих полів. Форма пошуку розташована на сторінці профілю у верхньому правому куті, поруч із перемикачем теми та іконкою сповіщень. Це оновлення робить пошук потрібних користувачів швидким і зручним, полегшуючи доступ до профілів",
      },
      upd3: {
        title: 'Функція зміни часу поданної заявки на співбесіду',
        text: "Додано функцію зміни часу поданої заявки на співбесіду. Ця нова можливість дозволяє користувачам легко змінювати запланований час співбесіди без необхідності подавати нову заявку. Це значно підвищує гнучкість у плануванні співбесід, дозволяючи краще координувати графіки кандидатів та інтерв'юерів. Завдяки цій функції користувачі можуть швидко змінити час заявки, адаптуючи її до свого розкладу або непередбачених обставин.",
      },
      upd4: {
        title: 'Пошук скілів користувача',
        text: 'Тепер ви можете легко знаходити необхідні навички користувачів, отримуючи краще уявлення про їхню кваліфікацію. Інтуїтивна форма пошуку дозволяє вводити ключові слова та отримувати результати миттєво, що значно полегшує доступ до потрібних вмінь. Це оновлення забезпечує швидкий і зручний пошук навичок, роблячи навігацію на платформі більш ефективною. Щоб скористатися пошуком, просто перейдіть на профіль користувача у розділ «Навички» та введіть необхідні скіли у форму пошуку.',
      },
      upd5: {
        title: 'Оновлення дизайну основної сторінки',
        text: "Оновлений дизайн з покращеною кольоровою гамою, а також додано форму зворотного зв'язку та контактні дані для зручного спілкування з нами. Додали основну інформацію про можливості та переваги платформи, для кращого розуміння її роботи. Створено розділ FAQ із найчастішими запитаннями для вашої зручності. Ми також оновили візуальний вигляд форм реєстрації, входу та підтвердження електронної пошти. Усі ці зміни спрямовані на покращення вашого досвіду та комфорту на нашій платформі",
      },
    },
    modalNotifyText: {
      workExperience: {
        create: {
          success: 'Успішно додано',
          error: 'Щось пішло не так',
          duplicateResponsibility: 'Ця відповідальність вже існує',
        },
        edit: {
          success: 'Успішно відредаговано',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
      education: {
        create: {
          success: 'Успішно додано',
          error: 'Щось пішло не так',
        },
        edit: {
          success: 'Успішно відредаговано',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
      achievement: {
        create: {
          success: 'Успішно додано',
          error: 'Щось пішло не так',
        },
        edit: {
          success: 'Успішно відредаговано',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
      personal: {
        create: {
          success: 'Успішно відправлено',
          error: 'Щось пішло не так',
        },
        edit: {
          success: 'Успішно відредаговано',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
      avatar: {
        create: {
          success: 'Успішно додано',
          error: 'Щось пішло не так',
        },
        edit: {
          success: 'Успішно відредаговано',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
      contacts: {
        create: {
          success: 'Успішно відправлено',
          error: 'Щось пішло не так',
        },
        edit: {
          success: 'Успішно відредаговано',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
      language: {
        add: {
          success: 'Успішно додано',
          error: 'Щось пішло не так',
        },
        create: {
          success: 'Успішно відправлено',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
      hardSkills: {
        add: {
          success: 'Успішно додано',
          error: 'Щось пішло не так',
        },
        create: {
          success: 'Успішно відправлено',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
      softSkills: {
        add: {
          success: 'Успішно додано',
          error: 'Щось пішло не так',
        },
        create: {
          success: 'Успішно відправлено',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
      specialization: {
        create: {
          success: 'Спеціалізацію {{values}} успішно додано',
          error: 'Не вдалося створити спеціалізацію',
        },
        edit: {
          success: 'Успішно відредаговано на {{name}}',
          error: 'Щось пішло не так',
        },
        delete: {
          success: '{{name}} успішно видалено',
          error: 'Щось пішло не так',
        },
        change: {
          success: '{{name}} успішно встановлено як основну спеціалізацію',
          error: 'Не вдалося встановити {{name}} як основну спеціалізацію',
        },
      },
      interview: {
        create: {
          success: 'Успішно відправлено',
          error: 'Щось пішло не так',
        },
        edit: {
          success: 'Успішно відредаговано',
          error: 'Щось пішло не так',
        },
        delete: {
          success: 'Успішно видалено',
          error: 'Щось пішло не так',
        },
      },
    },
    interviews: {
      emptyInterviewTabs: {
        emptyScheduled:
          'У вас ще немає запланованих співбесід. Чудова можливість зробити перший крок! Запишіться на зустріч, щоб перевірити свої знання, отримати цінний досвід і впевнено рухатися до своїх цілей.',
        emptyPassed:
          'На даний момент у вас немає завершених співбесід. Створіть запит і зробіть перший крок до нових можливостей! Знайдіть інтерв’юера, який допоможе вам оцінити знання та підготуватися до викликів.',
        emptyRequest:
          'Тут поки що нічого немає. Створіть запит на співбесіду і зробіть крок до розвитку! Знайдіть інтерв’юера, який допоможе вам перевірити свої знання та підготуватися до майбутніх викликів. Кожна розмова – це новий досвід і можливість стати впевненішим у своїх силах.',
        emptySpecialization:
          'У вас ще немає обраної спеціалізації. Визначте сферу своїх інтересів, щоб отримати доступ до співбесід. Оберіть напрямок, який вас цікавить, і відкрийте нові можливості. Це допоможе вам знайти інтерв’юера чи респондента, перевірити свої знання та краще підготуватися до майбутніх викликів.',
      },
      navigationLinks: {
        scheduled: 'Заплановані',
        passed: 'Пройдені',
        requests: 'Запити',
      },
      sideBar: {
        title: 'Інтерв’ю',
        event: {
          role: 'Роль',
          host: 'Хост',
          statusInProcess: 'В процесі',
          statusAwaitingFeedback: 'Очікується відгук',
        },
      },
      passedInterviews: {
        interviewersAssessmentTitle: 'Оцінки співбесідника',
        interviewInfoTitle: 'Інформація про співбесіду',
        interviewInfoYearAgo: 'рік(ів) тому назад',
        interviewInfoMonthAgo: 'місяць(місяців) тому назад',
        interviewInfoWeekAgo: 'тиждень(ів) тому назад',
        interviewInfoDayAgo: 'день(днів) тому назад',
        interviewInfoHourAgo: 'година(годин) тому назад',
        interviewInfoToday: 'Пройдено сьогодні',
        interviewInfoRole: 'Ваша роль',
        interviewInfoHost: 'Хост',
        interviewFeedbackTitle: 'Відгук співбесідника',
        interviewFeedbackReadLess: 'Читати менше',
        interviewFeedbackReadMore: 'Читати більше',
        interviewStatisticsTitle: 'Статистика',
        interviewStatisticsHardSkills: 'Hard Skills',
        interviewStatisticsSoftSkills: 'Soft Skills',
        interviewStatisticsOverall: 'Over All',
      },
      scheduleInterviewModal: {
        title: 'Запланувати співбесіду',
        scheduleBtn: 'Запланувати',
        specializationInputTitle: 'Спеціалізація',
        languageInputTitle: 'Мова',
        interviewCountTooltip:
          'Виберіть максимальну кількість інтерв’ю, які можна призначити для обраних таймслотів. Цей параметр дозволяє обмежити кількість інтерв’ю в межах ваших часових можливостей',
        interviewCountTitle: "Кількість інтерв'ю для обраних таймслотів",
        commentTitle: 'Коментар',
        commentPlaceholder: 'Опишіть, що ви очікуєте від інтерв’ю',
        required: "Це обов'язкове поле",
        comment_min: 'Коментар має бути більше 5 символів',
        comment_max: 'Коментар має бути менше 100 символів',
        interviewCount_min: 'Вибери хоча б 1 таймслот',
        interviewCount_max: 'Перестарався. Забагато вибрано',
        timeslotDescription1: 'Обрана кількість інтерв’ю — ',
        timeslotDescription2: 'Таймслотів має бути обрано не менше ',
        timeslotDescriptionError: 'Ви обрали недостатню кількість таймслотів. Додайте щонайменше ',
        warning: 'Для обраної спеціалізації вже є запит в ролі',
        thisWeek: 'Цей тиждень',
        save: 'Зберегти',
        interviewCount_exceeds_pendingSlots: 'Кількість співбесід не може перевищувати доступні слоти.',
        chooseTimeslot: 'Оберіть зручний час',
      },
    },
    singleScheduledInterview: {
      scheduledMeeting: {
        title: 'Запланована зустріч',
        participants: 'Учасники',
        language: 'Мова',
        duration: 'Тривалість',
        platform: 'Платформа',
        link:
          'Ваш урок розпочнеться в запланований час. Скасувати або перенести його можна за 24 години до початку.' +
          ' Ознайомтесь з нашою <a>політикою скасування</a> для деталей.',
        canceledMeeting: 'Скасувати зустріч',
        joinMeeting: 'Доєднатись до інтерв’ю',
        notHappenedMeeting: 'Співбесіда не відбулася',
        leaveFeedbackMeeting: 'Залишити відгук',
        durationType: 'хв.',
        canceled: {
          success: 'Зустріч успішно скасована',
          error: 'Щось пішло не так',
        },
      },
      interviewSkills: {
        skills: 'Навички',
      },
      userCardScheduledInterview: {
        btn: 'Написати повідомлення',
        interviewLvl: 'Рівень співбесіди:',
      },
      participantEvaluations: {
        title: 'Оцінка учасників',
      },
      statistic: {
        title: 'Статистика',
      },
    },
    chat: {
      search: 'Пошук',
      emptyChatLstUsers: 'Поки немає чатів',
      enterMessages: 'Введіть повідомлення',
    },
    interviewRequest: {
      title: 'Запити',
      loading: 'Завантаження спеціалізацій...',
      noSpecializationsAvailable: 'No specializations available',
      selectSpecializations: 'Спеціалізації',
      role: {
        candidate: 'Кандидат',
        interviewer: "Інтерв'юер",
      },
      requestHeader: {
        titleLauncher: 'як',
        foundInterviews: "Знайдено інтерв'ю:",
        totalInterviews: "Кількість інтерв'ю:",
        selectedTimeSlots: "Вибрана кількість інтерв'ю:",
        interviewLanguage: 'Мова співбесіди:',
      },
      buttons: {
        addTimeSlot: 'Додати час',
      },
      timeSlot: {
        status: {
          status: 'Статус:',
          pending: 'Очікує',
          booked: 'Намічено',
          expired: 'Минув',
        },
        daysOfWeek: {
          monday: 'Понеділок',
          tuesday: 'Вівторок',
          wednesday: 'Середа',
          thursday: 'Четвер',
          friday: 'Пятниця',
          saturday: 'Субота',
          sunday: 'Неділя',
        },
      },
      notifications: {
        delete: {
          oneTimeSlot: {
            success: 'Deleted slot successfully',
            error: 'Something went wrong',
          },
          allTimeSlots: {
            success: 'Deleted all successfully',
            error: 'Something went wrong',
          },
        },
      },
      deleteAllRequests: {
        title: 'Delete request',
        cancel: 'Cancel',
        approve: 'Remove',
        question: 'Are you sure you want to delete the {{mastery}} interview request as a {{role}}?',
      },
    },
  },
};
